# Задание №6
def int_func(*args):
    word = input('Введите слово с маленькой буквы и мы вернём Вам заглавную букву: ')
    print(word.title())
    return
int_func()